{
  "users": [
    {
      "id": "1",
      "name": "John Doe",
      "email": "arigbojesse@gmail.com",
      "password": "123abc",
      "created_at": "2023-10-01T12:00:00Z"
    },
    {
      "id": "3",
      "name": "Jesse Arigbo",
      "username": "@jessearigbo",
      "email": "arigbojesse75@gmail.com",
      "password": "je$$ear1",
      "createdAt": "2025-05-13T21:11:59.420Z"
    },
    {
      "id": "4",
      "name": "jessearigbo",
      "email": "arigbojesse@gmail.com",
      "password": "je$$ear1",
      "createdAt": "2025-05-13T21:23:29.226Z"
    },
    {
      "id": "5",
      "name": "jessearigbo",
      "email": "arigbojesse@gmail.com",
      "password": "je$$ear1",
      "createdAt": "2025-05-13T21:26:13.852Z"
    },
    {
      "id": "6",
      "name": "jessearigbo",
      "email": "arigbojesse@gmail.com",
      "password": "je$$ear1",
      "createdAt": "2025-05-13T21:27:41.506Z"
    },
    {
      "id": "7",
      "name": "jessearigbo",
      "email": "arigbojesse@gmail.com",
      "password": "je$$ear1",
      "createdAt": "2025-05-13T21:30:53.148Z"
    },
    {
      "id": "8",
      "name": "jessearigbo",
      "email": "arigbojesse@gmail.com",
      "password": "je$$ear1",
      "createdAt": "2025-05-13T21:31:10.366Z"
    },
    {
      "id": "9",
      "name": "jessearigbo",
      "email": "arigbojesse@gmail.com",
      "password": "je$$ear1",
      "createdAt": "2025-05-13T21:46:03.856Z"
    },
    {
      "id": "10",
      "name": "jessearigbo",
      "email": "arigbojesse@gmail.com",
      "password": "je$$ear2",
      "createdAt": "2025-05-13T21:46:32.732Z"
    },
    {
      "id": "11",
      "name": "jessearigbo",
      "email": "arigbojesse@gmail.com",
      "password": "je$$ear3",
      "createdAt": "2025-05-13T21:48:26.825Z"
    },
    {
      "id": "12",
      "name": "jessearigbo",
      "email": "arigbojesse@gmail.com",
      "password": "je$$ear4",
      "createdAt": "2025-05-13T21:49:30.175Z"
    },
    {
      "id": "13",
      "name": "jessearigbo",
      "email": "arigbojesse75@gmail.com",
      "password": "je$$ear4",
      "createdAt": "2025-05-13T21:49:59.320Z"
    },
    {
      "id": "14",
      "name": "jessearigbo",
      "email": "arigbojesse75@gmail.com",
      "password": "je$$ear5",
      "createdAt": "2025-05-13T21:50:42.303Z"
    },
    {
      "id": "15",
      "name": "jessearigbo",
      "email": "arigbojesse@gmail.com",
      "password": "je$$ear6",
      "createdAt": "2025-05-13T21:51:50.492Z"
    },
    {
      "id": "16",
      "name": "jessearigbo",
      "email": "arigbojesse75@gmail.com",
      "password": "je$$ear7",
      "createdAt": "2025-05-13T21:56:46.458Z"
    },
    {
      "id": "17",
      "name": "jessearigbo",
      "email": "arigbojesse@gmail.com",
      "password": "ke$$ear1",
      "createdAt": "2025-05-13T21:59:30.377Z"
    },
    {
      "id": "18",
      "name": "jessearigbo",
      "email": "arigbojesse75@gmail.com",
      "password": "ke$$ear5",
      "createdAt": "2025-05-13T22:02:57.416Z"
    },
    {
      "id": "19",
      "name": "jessearigbo",
      "email": "arigbojesse75@gmail.com",
      "password": "ke$$ear4",
      "createdAt": "2025-05-13T22:03:49.081Z"
    }
  ],
  "notifications": [
    {
      "id": "1",
      "user_id": 3,
      "sender": "Spentrack",
      "sender_dp": "/Logomark.png",
      "sender_id": 1,
      "message": "Welcome to Expense Calculator!",
      "read": true,
      "created_at": "2023-10-01T12:05:00Z"
    },
    {
      "id": "2",
      "user_id": 3,
      "sender": "Spentrack",
      "sender_dp": "/Logomark.png",
      "sender_id": 1,
      "message": "Welcome to Expense Calculator!",
      "read": true,
      "created_at": "2023-10-01T14:05:00Z"
    },
    {
      "id": "3",
      "user_id": 3,
      "sender": "Spentrack",
      "sender_dp": "/Logomark.png",
      "sender_id": 1,
      "message": "Welcome to Expense Calculator!",
      "read": true,
      "created_at": "2023-10-01T14:05:00Z"
    },
    {
      "id": "4",
      "user_id": 4,
      "sender": "Spentrack",
      "sender_dp": "/Logomark.png",
      "sender_id": 1,
      "message": "Welcome to Expense Calculator!",
      "read": false,
      "created_at": "2023-10-01T12:05:00Z"
    }
  ],
  "blogs": [
    {
      "id": "1",
      "user_id": 1,
      "title": "5 Simple Ways to Save Money",
      "content": "Saving money is an essential skill that can help you achieve financial stability and reach your goals. To start, tracking your expenses is crucial. By understanding where your money goes, you can identify areas where you can cut back. Setting a budget is another effective way to manage your finances. A budget allows you to allocate your income towards necessities, savings, and discretionary spending. Cutting unnecessary costs is also important. For example, consider canceling subscriptions you no longer use or finding more affordable alternatives for services. Additionally, cooking at home instead of dining out can save you a significant amount of money over time. Lastly, consider automating your savings. By setting up automatic transfers to a savings account, you can ensure that you consistently save a portion of your income without having to think about it. These simple steps can make a big difference in your financial health and help you build a secure future.",
      "author": "Alice Johnson",
      "created_at": "2023-10-01T14:00:00Z",
      "likes": 120,
      "dislikes": 10,
      "engagements": 500
    },
    {
      "id": "2",
      "user_id": 2,
      "title": "How to Save on Groceries",
      "content": "Groceries are a significant expense for most households, but there are many ways to save money without compromising on quality. Start by planning your meals for the week. Meal planning helps you create a shopping list of only the items you need, reducing impulse purchases. Using coupons and taking advantage of store discounts can also lead to substantial savings. Buying in bulk is another effective strategy, especially for non-perishable items. However, be cautious not to overbuy perishable goods that may go to waste. Shopping at discount stores or local farmers' markets can also help you find affordable options. Additionally, consider purchasing store-brand products, which are often cheaper than name-brand items but offer similar quality. Avoid shopping when you're hungry, as this can lead to unnecessary purchases. By implementing these strategies, you can significantly reduce your grocery bill and free up money for other priorities.",
      "author": "Bob Smith",
      "created_at": "2023-10-02T10:00:00Z",
      "likes": 85,
      "dislikes": 5,
      "engagements": 400
    },
    {
      "id": "3",
      "user_id": 3,
      "title": "The Importance of an Emergency Fund",
      "content": "An emergency fund is a financial safety net that can protect you from unexpected expenses and provide peace of mind. Building an emergency fund starts with setting a goal. Financial experts recommend saving three to six months' worth of living expenses. To achieve this, set aside a portion of your income each month. Automating your savings can make this process easier and more consistent. It's important to keep your emergency fund in a separate, easily accessible account, such as a high-yield savings account. This ensures that the money is available when you need it but not too tempting to spend on non-emergencies. Avoid using your emergency fund for discretionary expenses; it should only be used for true emergencies, such as medical bills, car repairs, or unexpected job loss. Having an emergency fund can reduce financial stress and help you navigate life's uncertainties with confidence.",
      "author": "Alice Johnson",
      "created_at": "2023-10-03T09:30:00Z",
      "likes": 95,
      "dislikes": 8,
      "engagements": 450
    },
    {
      "id": "4",
      "user_id": 4,
      "title": "Cutting Down on Utility Bills",
      "content": "Utility bills can take up a significant portion of your monthly budget, but there are many ways to reduce these costs. Start by switching to energy-efficient appliances, which use less electricity and can lower your energy bills over time. Installing a programmable thermostat can also help you save money by optimizing your heating and cooling usage. Simple habits, such as turning off lights when you leave a room and unplugging electronics when they're not in use, can make a big difference. Sealing drafts around windows and doors can prevent heat loss in the winter and keep your home cooler in the summer, reducing your reliance on heating and air conditioning. Additionally, consider using water-saving fixtures, such as low-flow showerheads and faucets, to reduce your water bill. By implementing these strategies, you can cut down on utility costs and free up money for other financial goals.",
      "author": "Charlie Brown",
      "created_at": "2023-10-04T08:45:00Z",
      "likes": 70,
      "dislikes": 6,
      "engagements": 300
    },
    {
      "id": "5",
      "user_id": 5,
      "title": "How to Save for Retirement",
      "content": "Saving for retirement is one of the most important financial goals you can set. The earlier you start, the more time your money has to grow through compound interest. Begin by contributing to a retirement account, such as a 401(k) or an IRA. If your employer offers a 401(k) match, take full advantage of it, as it's essentially free money. Setting a specific retirement savings goal can help you stay motivated and on track. Consider working with a financial advisor to determine how much you need to save based on your desired retirement lifestyle. Regularly review and adjust your contributions as your income and expenses change. Diversifying your investments can also help you manage risk and maximize returns. Remember, the key to successful retirement planning is consistency and discipline. By prioritizing your retirement savings now, you can enjoy financial security and peace of mind in your later years.",
      "author": "Alice Johnson",
      "created_at": "2023-10-05T11:15:00Z",
      "likes": 110,
      "dislikes": 7,
      "engagements": 550
    },
    {
      "id": "6",
      "user_id": 6,
      "title": "Tips for Managing Debt Effectively",
      "content": "Managing debt is a critical aspect of financial health. Start by creating a list of all your debts, including the amounts owed, interest rates, and minimum payments. Prioritize paying off high-interest debts first, as they cost you the most over time. Consider using the snowball or avalanche method to tackle your debts systematically. The snowball method involves paying off the smallest debts first to build momentum, while the avalanche method focuses on the highest-interest debts. Creating a budget can help you allocate more funds towards debt repayment. Avoid taking on new debt while you're working to pay off existing balances. If possible, negotiate with creditors for lower interest rates or payment plans. Consolidating debts into a single loan with a lower interest rate can also simplify repayment. By staying disciplined and focused, you can reduce your debt burden and achieve financial freedom.",
      "author": "Bob Smith",
      "created_at": "2023-10-06T13:00:00Z",
      "likes": 90,
      "dislikes": 4,
      "engagements": 420
    },
    {
      "id": "7",
      "user_id": 7,
      "title": "Investing for Beginners",
      "content": "Investing is a powerful way to grow your wealth over time, but it can be intimidating for beginners. Start by setting clear financial goals and determining your risk tolerance. Educate yourself about different investment options, such as stocks, bonds, mutual funds, and ETFs. Diversification is key to managing risk, so avoid putting all your money into a single investment. Consider starting with low-cost index funds, which provide broad market exposure and are ideal for long-term growth. Open a brokerage account or use a robo-advisor to begin investing. Consistency is crucial, so aim to invest regularly, even if it's a small amount. Avoid trying to time the market, as this can lead to costly mistakes. Instead, focus on a long-term strategy and stay disciplined. By starting early and staying informed, you can build a strong investment portfolio and achieve your financial goals.",
      "author": "Charlie Brown",
      "created_at": "2023-10-07T15:30:00Z",
      "likes": 100,
      "dislikes": 5,
      "engagements": 480
    },
    {
      "id": "8",
      "user_id": 8,
      "title": "The Benefits of Financial Literacy",
      "content": "Financial literacy is the foundation of sound financial decision-making. It empowers individuals to manage their money effectively, avoid debt, and achieve their financial goals. Start by learning the basics of budgeting, saving, and investing. Understanding how interest rates, credit scores, and loans work can help you make informed choices. Financial literacy also involves recognizing the importance of emergency funds and retirement planning. By improving your financial knowledge, you can identify opportunities to grow your wealth and protect yourself from financial pitfalls. Many resources, such as books, online courses, and workshops, are available to help you enhance your financial literacy. Remember, the more you know about managing money, the better equipped you'll be to navigate life's financial challenges and build a secure future.",
      "author": "Alice Johnson",
      "created_at": "2023-10-08T10:00:00Z",
      "likes": 120,
      "dislikes": 6,
      "engagements": 520
    },
    {
      "id": "9",
      "user_id": 9,
      "title": "How to Create a Monthly Budget",
      "content": "Creating a monthly budget is a crucial step towards achieving financial stability. Start by calculating your total income, including your salary, freelance earnings, and any other sources of revenue. Next, list all your expenses, such as rent, utilities, groceries, and discretionary spending. Categorize your expenses into fixed and variable costs. Allocate a portion of your income towards savings and debt repayment. Use budgeting tools or apps to track your spending and ensure you stay within your limits. Review your budget regularly and make adjustments as needed. By sticking to a budget, you can avoid overspending, save for future goals, and gain better control over your finances.",
      "author": "Bob Smith",
      "created_at": "2023-10-09T14:00:00Z",
      "likes": 95,
      "dislikes": 3,
      "engagements": 450
    },
    {
      "id": "10",
      "user_id": 10,
      "title": "The Power of Compound Interest",
      "content": "Compound interest is a powerful financial concept that can significantly grow your wealth over time. It works by earning interest on both your initial investment and the interest that accumulates over time. The earlier you start investing, the more time your money has to compound. For example, investing $1,000 at an annual interest rate of 5% will grow to $1,628 in 10 years and $2,653 in 20 years. To maximize the benefits of compound interest, contribute regularly to your savings or investment accounts. Avoid withdrawing funds prematurely, as this can disrupt the compounding process. By understanding and leveraging compound interest, you can achieve your financial goals faster and build a secure future.",
      "author": "Charlie Brown",
      "created_at": "2023-10-10T16:30:00Z",
      "likes": 130,
      "dislikes": 7,
      "engagements": 600
    },
    {
      "id": "11",
      "user_id": 11,
      "title": "Understanding Credit Scores",
      "content": "A credit score is a numerical representation of your creditworthiness, and it plays a crucial role in your financial life. Lenders use credit scores to assess the risk of lending you money. A higher credit score can lead to better loan terms and lower interest rates. To maintain a good credit score, pay your bills on time, keep your credit utilization low, and avoid opening too many new accounts at once. Regularly check your credit report for errors and dispute any inaccuracies. Building a strong credit history takes time, so start early and be consistent in managing your finances. By understanding and improving your credit score, you can unlock better financial opportunities.",
      "author": "Alice Johnson",
      "created_at": "2023-10-11T12:00:00Z",
      "likes": 110,
      "dislikes": 4,
      "engagements": 550
    },
    {
      "id": "12",
      "user_id": 12,
      "title": "The Importance of Setting Financial Goals",
      "content": "Setting financial goals is essential for achieving financial success. Goals provide direction and motivation, helping you stay focused on your financial journey. Start by identifying short-term, medium-term, and long-term goals. Short-term goals may include saving for a vacation or paying off a credit card, while long-term goals could involve retirement planning or buying a home. Make your goals SMART: Specific, Measurable, Achievable, Relevant, and Time-bound. Break down larger goals into smaller, manageable steps to track your progress. Regularly review and adjust your goals as needed to stay aligned with your financial situation. By setting clear financial goals, you can create a roadmap for your financial future and work towards achieving your dreams.",
      "author": "Bob Smith",
      "created_at": "2023-10-12T14:30:00Z",
      "likes": 100,
      "dislikes": 5,
      "engagements": 500
    },
    {
      "id": "13",
      "user_id": 13,
      "title": "How to Build Wealth Over Time",
      "content": "Building wealth is a long-term process that requires discipline, patience, and smart financial decisions. Start by creating a budget to track your income and expenses. Prioritize saving and investing a portion of your income each month. Consider diversifying your investments across different asset classes, such as stocks, bonds, and real estate, to manage risk. Take advantage of employer-sponsored retirement plans and individual retirement accounts (IRAs) to maximize your savings. Continuously educate yourself about personal finance and investment strategies to make informed decisions. Avoid lifestyle inflation by keeping your expenses in check as your income grows. By consistently saving and investing over time, you can build significant wealth and achieve financial independence.",
      "author": "Charlie Brown",
      "created_at": "2023-10-13T09:00:00Z",
      "likes": 120,
      "dislikes": 6,
      "engagements": 520
    }
  ],
  "transactions": [
    {
      "id": "1",
      "user_id": 3,
      "type": "expense",
      "amount": 50,
      "category": "Food",
      "date": "2023-11-01",
      "description": "Lunch at a cafe"
    },
    {
      "id": "41",
      "user_id": 4,
      "type": "income",
      "amount": 300,
      "category": "Freelance",
      "date": "2023-11-02",
      "description": "Freelance project payment"
    },
    {
      "id": "42",
      "user_id": 5,
      "type": "expense",
      "amount": 100,
      "category": "Transport",
      "date": "2023-11-03",
      "description": "Gas refill"
    },
    {
      "id": "43",
      "user_id": 6,
      "type": "income",
      "amount": 200,
      "category": "Gift",
      "date": "2023-11-04",
      "description": "Birthday gift"
    },
    {
      "id": "44",
      "user_id": 3,
      "type": "expense",
      "amount": 75,
      "category": "Entertainment",
      "date": "2023-11-05",
      "description": "Movie night"
    },
    {
      "id": "45",
      "user_id": 4,
      "type": "income",
      "amount": 500,
      "category": "Salary",
      "date": "2023-11-06",
      "description": "Monthly salary"
    },
    {
      "id": "46",
      "user_id": 5,
      "type": "expense",
      "amount": 120,
      "category": "Groceries",
      "date": "2023-11-07",
      "description": "Weekly groceries"
    },
    {
      "id": "47",
      "user_id": 6,
      "type": "expense",
      "amount": 60,
      "category": "Dining",
      "date": "2023-11-08",
      "description": "Dinner with friends"
    },
    {
      "id": "48",
      "user_id": 3,
      "type": "income",
      "amount": 400,
      "category": "Bonus",
      "date": "2023-11-09",
      "description": "Performance bonus"
    },
    {
      "id": "49",
      "user_id": 4,
      "type": "expense",
      "amount": 90,
      "category": "Health",
      "date": "2023-11-10",
      "description": "Pharmacy purchase"
    },
    {
      "id": "50",
      "user_id": 5,
      "type": "expense",
      "amount": 150,
      "category": "Rent",
      "date": "2023-11-11",
      "description": "Monthly rent"
    },
    {
      "id": "51",
      "user_id": 6,
      "type": "income",
      "amount": 100,
      "category": "Investment",
      "date": "2023-11-12",
      "description": "Stock dividends"
    },
    {
      "id": "52",
      "user_id": 3,
      "type": "expense",
      "amount": 40,
      "category": "Snacks",
      "date": "2023-11-13",
      "description": "Coffee and snacks"
    },
    {
      "id": "53",
      "user_id": 4,
      "type": "expense",
      "amount": 250,
      "category": "Travel",
      "date": "2023-11-14",
      "description": "Weekend trip"
    },
    {
      "id": "54",
      "user_id": 5,
      "type": "income",
      "amount": 150,
      "category": "Freelance",
      "date": "2023-11-15",
      "description": "Freelance project"
    },
    {
      "id": "55",
      "user_id": 6,
      "type": "expense",
      "amount": 80,
      "category": "Fitness",
      "date": "2023-11-16",
      "description": "Gym membership"
    },
    {
      "id": "56",
      "user_id": 3,
      "type": "expense",
      "amount": 120,
      "category": "Education",
      "date": "2023-11-17",
      "description": "Online course"
    },
    {
      "id": "57",
      "user_id": 4,
      "type": "expense",
      "amount": 50,
      "category": "Books",
      "date": "2023-11-18",
      "description": "Bought a novel"
    },
    {
      "id": "58",
      "user_id": 5,
      "type": "income",
      "amount": 250,
      "category": "Freelance",
      "date": "2023-11-19",
      "description": "Freelance writing"
    },
    {
      "id": "59",
      "user_id": 6,
      "type": "expense",
      "amount": 100,
      "category": "Dining",
      "date": "2023-11-20",
      "description": "Dinner with family"
    },
    {
      "id": "60",
      "user_id": 3,
      "type": "income",
      "amount": 600,
      "category": "Salary",
      "date": "2023-11-21",
      "description": "Monthly salary"
    },
    {
      "id": "61",
      "user_id": 4,
      "type": "expense",
      "amount": 200,
      "category": "Rent",
      "date": "2023-11-22",
      "description": "Monthly rent"
    },
    {
      "id": "62",
      "user_id": 5,
      "type": "income",
      "amount": 300,
      "category": "Freelance",
      "date": "2023-11-23",
      "description": "Freelance project"
    },
    {
      "id": "63",
      "user_id": 6,
      "type": "expense",
      "amount": 50,
      "category": "Snacks",
      "date": "2023-11-24",
      "description": "Coffee and snacks"
    },
    {
      "id": "64",
      "user_id": 3,
      "type": "income",
      "amount": 400,
      "category": "Bonus",
      "date": "2023-11-25",
      "description": "Performance bonus"
    },
    {
      "id": "65",
      "user_id": 4,
      "type": "expense",
      "amount": 100,
      "category": "Health",
      "date": "2023-11-26",
      "description": "Pharmacy purchase"
    },
    {
      "id": "66",
      "user_id": 5,
      "type": "income",
      "amount": 700,
      "category": "Salary",
      "date": "2023-11-27",
      "description": "Monthly salary"
    },
    {
      "id": "67",
      "user_id": 6,
      "type": "expense",
      "amount": 150,
      "category": "Groceries",
      "date": "2023-11-28",
      "description": "Weekly groceries"
    },
    {
      "id": "68",
      "user_id": 3,
      "type": "income",
      "amount": 800,
      "category": "Gift",
      "date": "2023-11-29",
      "description": "Received a gift"
    },
    {
      "id": "69",
      "user_id": 4,
      "type": "expense",
      "amount": 200,
      "category": "Travel",
      "date": "2023-11-30",
      "description": "Vacation trip"
    },
    {
      "id": "70",
      "user_id": 5,
      "type": "income",
      "amount": 900,
      "category": "Freelance",
      "date": "2023-12-01",
      "description": "Freelance project"
    },
    {
      "id": "71",
      "user_id": 6,
      "type": "expense",
      "amount": 300,
      "category": "Education",
      "date": "2023-12-02",
      "description": "Online course"
    },
    {
      "id": "72",
      "user_id": 3,
      "type": "income",
      "amount": 1000,
      "category": "Investment",
      "date": "2023-12-03",
      "description": "Stock dividends"
    },
    {
      "id": "73",
      "user_id": 4,
      "type": "expense",
      "amount": 400,
      "category": "Fitness",
      "date": "2023-12-04",
      "description": "Gym membership"
    },
    {
      "id": "74",
      "user_id": 5,
      "type": "income",
      "amount": 1100,
      "category": "Salary",
      "date": "2023-12-05",
      "description": "Monthly salary"
    },
    {
      "id": "75",
      "user_id": 6,
      "type": "expense",
      "amount": 500,
      "category": "Rent",
      "date": "2023-12-06",
      "description": "Monthly rent"
    },
    {
      "id": "76",
      "user_id": 3,
      "type": "income",
      "amount": 1200,
      "category": "Bonus",
      "date": "2023-12-07",
      "description": "Performance bonus"
    },
    {
      "id": "77",
      "user_id": 4,
      "type": "expense",
      "amount": 600,
      "category": "Travel",
      "date": "2023-12-08",
      "description": "Vacation trip"
    },
    {
      "id": "78",
      "user_id": 5,
      "type": "income",
      "amount": 1300,
      "category": "Freelance",
      "date": "2023-12-09",
      "description": "Freelance project"
    },
    {
      "id": "79",
      "user_id": 6,
      "type": "expense",
      "amount": 700,
      "category": "Groceries",
      "date": "2023-12-10",
      "description": "Weekly groceries"
    }
  ],
  "goals": [
    {
      "id": "1",
      "user_id": 1,
      "name": "Vacation Fund",
      "target_amount": 2000,
      "current_amount": 500,
      "deadline": "2024-06-01T00:00:00Z"
    }
  ],
  "budgets": [
    {
      "id": "1",
      "user_id": 1,
      "category": "Groceries",
      "limit": 300,
      "start_date": "2023-10-01T00:00:00Z",
      "end_date": "2023-10-31T23:59:59Z"
    }
  ],
  "savings": [
    {
      "id": "1",
      "user_id": 1,
      "amount": 1000,
      "created_at": "2023-10-01T12:00:00Z"
    }
  ]
}